# Bar Terminations Data Termination Orientation At End Property

Source: https://www.revitapidocs.com/2026/fa6b10af-eb3b-4e5c-a04f-f4b6032f45a7.htm

---

| Bar Terminations Data Termination Orientation At End Property |
| --- |

Identifies the orientation of the termination's (e.g. hook, crank) plane at the end of the bar with respect to the orientation of the last curve and the plane normal.

Only two values are permitted:

Value \= Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."

Value \= Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."

The default value is Left.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarTerminationOrientation TerminationOrientationAtEnd { get; set; }
```

```
Public Property TerminationOrientationAtEnd As RebarTerminationOrientation
	Get
	Set
```

```
public:
property RebarTerminationOrientation TerminationOrientationAtEnd {
	RebarTerminationOrientation get ();
	void set (RebarTerminationOrientation value);
}
```

```
member TerminationOrientationAtEnd : RebarTerminationOrientation with get, set
```

#### Property Value

RebarTerminationOrientation Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace